// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// * 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// * 6, 1, 33 -> [6, 1, 33]

//====================  ИНИЦИАЛИЗАЦИЯ НОВОГО МАССИВА  ======================
int[] array = new int[8];

//===================  ЗАПОЛНЕНИЕ МАССИВА ПОЛЬЗОВАТЕЛЬСКИМ ВВОДОМ =============
for(int i = 0; i < array.Length; i++)
{
    Console.Write("Введите значение {0}: ", i+1);
    array[i] = Convert.ToInt32(Console.ReadLine());
}

Console.WriteLine("");  // ОТСТУП

//===================  ОТОБРАЖЕНИЕ МАССИВА НА ЭКРАНЕ  ================================
Console.Write("Массив = [");
for(int i = 0; i < array.Length; i++)
{
    if(i == 7) Console.Write(array[i] + "]");
    else
    {
        Console.Write(array[i] + ", ");
    }
}


