// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// * 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// * 6, 1, 33 -> [6, 1, 33]


//====================  ИНИЦИАЛИЗАЦИЯ НОВОГО МАССИВА  ======================
int[] array = new int[8];
//===================  ЗАПОЛНЕНИЕ МАССИВА РАНДОМНЫМИ ЧИСЛАМИ =============
for(int i = 0; i < array.Length; i++)
{
    
    array[i] = new Random().Next(1, 100);
}

Console.WriteLine("");  // ОТСТУП

//===================  ОТОБРАЖЕНИЕ МАССИВА НА ЭКРАНЕ  ================================
Console.Write("Массив = [");
for(int i = 0; i < array.Length; i++)
{
    if(i == 7) Console.Write(array[i] + "]");
    else
    {
        Console.Write(array[i] + ", ");
    }
}


